{"name":"THIS SHIT AINT EASY!","description":"I recently got a dm after minting a KODA that basically said “Must be nice that things come so easy for people like you” \n\n\nAt first I was infuriated and wanted to respond at this persons audacity and what felt like a personal attack on my life.\n\n\nAfter holding back I reflected on the journey that it took to even get anywhere close to the place where I am now. My NFT journey really started in August 2021 after a what felt like an already crushing blow. In May @SwoleLuksoBags told me to get an Ape. I decided against it.\n\n\nWhen I finally decided to get involved. I did what I feel most people do. I looked for the next Bored Ape project. This consisted of thousands of dollars spent being rugged or stuck holding bags. That time also included hours upon hours of stressful and sleepless nights, days in front of the computer, lost time with my wife and family, unhealthy eating and drinking patterns and a huge toll on my mental health. Multiple times I wanted to just be done with the entire space as I just couldn’t figure it out. I watched as people won and I continued to lose.\n\n\nBut I knew in my heart that it was all worth it. That at the core of every venture, eventually it would work out. I sold almost everything valuable I owned (skydiving equipment, my truck and other items) because I wanted to be able to learn more and succeed here.\n\n\nI’m not telling anyone to sell anything btw. This is stuff I was willing to get rid of or made a profit on. In November we sold our home (market was crazy) I used $26k of that profit to buy my MAYC (my biggest investment into this space yet) Not an easy thing to do after all the Ls I had taken. But again I was willing to lose that money to grow here. \n\n\nAfter that yes the floor rose but I was holding so basically I still had no liquid to make any major plays. So I stuck to smaller flips which are again time consuming, stressful and take its toll.\n\n\nIn February of this year is when I started to actually have enough liquid to make bigger plays after 4 months of 24/7 work in this space. Then $APE was a win but again I still hold most after paying off a credit card. \n\n\nBottom line here is this all takes an ungodly amount of work, dedication, time, conviction, stress, sacrifice and the list goes on. I urge you to think about all of that the next time you look at someone and think it came easy. For a small few maybe yes but the majority probably put themselves and people they love thru hell.\n\n\nIm no where near where I want to be in this space so I continue to look up to those who are closer to my goal. If you read this thank you and I hope you took something away from it. I will continue to learn, grow and above all be grateful for this space.","attributes":[{"trait_type":"Author","value":"@trapphone_eth"},{"trait_type":"Palette","value":"Vincent Van Gogh"},{"trait_type":"Num colors","value":"4"},{"trait_type":"Style","value":"Modbot"},{"value":"Easy shit #5"},{"value":"Easy shit #1"},{"value":"Easy shit #4"},{"value":"Easy shit #7"},{"value":"Easy shit #3"},{"value":"Easy shit #6"},{"value":"Easy shit #2"},{"value":"Easy shit #8"}],"image":"https://www.the23.wtf/images/1690991920.png"}